app/controllers/welcome_controller.rb

  def index
  	if user_signed_in?
  		@my_posts = current_user.committed_tos
  		tag_ids = []
  		@my_posts.each do |p|
        ids = p.tags.pluck(:id)
        ids.each do |id|
          unless tag_ids.include?(id)
            tag_ids.push(id)
          end
        end
      end
  		if tag_ids.present?
  			@my_tags = Tag.find_all_by_id(tag_ids)
  		else
  			@my_tags = []
  		end
  	end
    @near_by_actions = Post.all
		@trending_actions = Post.all
		@trending_tags = Tag.last(8)
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags" ORDER BY id DESC LIMIT 8

    user.authority = authority
    user.purity = purity

    if user.save
---
UPDATE "users" SET "care" = 18, "fairness" = 18, "loyalty" = 18, "authority" = 18, "purity" = 18, "updated_at" = '2014-03-06 20:52:53.721981' WHERE "users"."id" = 1